fukuen/toppers-maixduino-demo/asp/OBJ/K210_GCC/WIFI/esp32_socket.c
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2020-2021 by fukuen
 * 
 *  上記著作権者は，以下の(1)～(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 *  $Id: esp32_socket.c 2416 2020-12-10 08:06:20Z fukuen $
 */

/* 
 *  ESP32_SOCKET プログラム
 */

#include <kernel.h>
#include <t_syslog.h>
#include <t_stdlib.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "device.h"
#include "esp32_socket.h"

#define printk printf
#define TIMEOUT 1

#define HIGH 0x1
#define LOW  0x0

#define INPUT           0x0
#define OUTPUT          0x3
#define INPUT_PULLUP    0x2
#define INPUT_PULLDOWN  0X1

#if defined(TOPPERS_BASE_PLATFORM_STF7)
#define i2c_send(h, a, b, l)    i2c_memwrite((h), (a), 0, 0, (b), (l), 500)
#define i2c_recv(h, a, b, l)    i2c_memread((h), (a), 0, 0, (b), (l), 500)
#else
#define i2c_send(h, a, b, l)    i2c_memwrite((h), (a), 0, 0, (b), (l))
#define i2c_recv(h, a, b, l)    i2c_memread((h), (a), 0, 0, (b), (l))
#endif

char ssid[32] = {0};
uint8_t mac[32] = {0};
esp32_net_t net_dat;
uint8_t cs_num, rst_num, rdy_num;
uint32_t time;

ESP32_Handle_t esp32Handle;

static esp32_params_t *esp32_params_alloc_1param(uint32_t len, uint8_t *buf);
static esp32_params_t *esp32_params_alloc_2param(uint32_t len_0, uint8_t *buf_0, uint32_t len_1, uint8_t *buf_1);
static int8_t esp32_send_command(ESP32_Handle_t *hesp, uint8_t cmd, esp32_params_t *params, uint8_t param_len_16);
static void delete_esp32_params(void *arg);

/*
*  ダイレクトデジタルピン設定
*/
void pinMode(uint8_t Pin, uint8_t dwMode)
{
	int gpionum = gpio_get_gpiohno(Pin, false);
	GPIO_Init_t init = {0};

	syslog_2(LOG_NOTICE, "## pinMode Pin(%d) gpionum(%d) ##", Pin, gpionum);
	if (gpionum >= 0)
	{
		uint8_t function = FUNC_GPIOHS0 + gpionum;
		fpioa_set_function(Pin, function);
		switch(dwMode){
		case INPUT:
			init.mode = GPIO_MODE_INPUT;
			init.pull = GPIO_NOPULL;
			break;
		case INPUT_PULLDOWN:
			init.mode = GPIO_MODE_INPUT;
			init.pull = GPIO_PULLDOWN;
			break;
		case INPUT_PULLUP:
			init.mode = GPIO_MODE_INPUT;
			init.pull = GPIO_PULLUP;
			break;
		case OUTPUT:
		default:
			init.mode = GPIO_MODE_OUTPUT;
			init.pull = GPIO_PULLDOWN;
			break;
		}
		gpio_setup(TADR_GPIOHS_BASE, &init, (uint8_t)gpionum);
	}
	return ;
}

/*
 *  ダイレクトデジタルピン出力
 */
void digitalWrite(uint8_t Pin, int dwVal)
{
	if (Pin == 0)
		return;

	int8_t gpio_pin = gpio_get_gpiohno(Pin, false);

	if (gpio_pin >= 0)
	{
		gpio_set_pin(TADR_GPIOHS_BASE, (uint8_t)gpio_pin, dwVal);
	}
}

/*
 *  ダイレクトデジタルピン入力
 */
int digitalRead(uint8_t Pin)
{
	if (Pin == 0)
		return 0;

	int8_t gpio_pin = gpio_get_gpiohno(Pin, false);
	if (gpio_pin >= 0)
	{
		return (int)gpio_get_pin(TADR_GPIOHS_BASE, (uint8_t)gpio_pin);
	}
	return -1;
}

/*
 *  ミリ秒取得
 */
uint32_t get_millis(void)
{
	SYSTIM tim;
	get_tim(&tim);
	return (uint32_t)(tim);
}

/*
 *  SPI 1 文字送受信
 */
uint8_t esp32_spi_rw(SPI_Handle_t *hspi, uint8_t data)
{
	uint8_t c;
	spi_esp32_transrecv(hspi, 0, &data, 1, &c, 1);
	spi_wait(hspi, 10);
	return c;
}

/*
 *  SPI 文字列送受信
 */
void esp32_spi_rw_len(SPI_Handle_t *hspi, uint8_t *send, uint8_t *recv, uint32_t len)
{
	if (send == NULL && recv == NULL)
	{
		printf(" buffer is null\r\n");
		return;
	}

	//only send
	if (send && recv == NULL)
	{
//	    spi_core_transmit(hspi, 0, send, len);
		spi_esp32_transrecv(hspi, 0, send, len, NULL, 0);
		spi_wait(hspi, 10);
		return;
	}

	//only recv
	if (send == NULL && recv)
	{
//	    spi_core_receive(hspi, 0, recv, (size_t)len);
//	    spi_esp32_transrecv(hspi, 0, NULL, 0, recv, len);
		spi_esp32_transrecv(hspi, 0, recv, len, recv, len);
		spi_wait(hspi, 10);
		return;
	}

	//send and recv
	if (send && recv)
	{
		spi_esp32_transrecv(hspi, 0, send, len, recv, len);
		spi_wait(hspi, 10);
		return;
	}
	return;
}

/*
 *  I2C 1 文字送受信
 */
uint8_t esp32_i2c_rw(I2C_Handle_t *hi2c, uint8_t data)
{
	uint8_t c;
	i2c_recv(hi2c, ESP32_ADDRESS, &c, 1);
	return c;
}

/*
 *  I2C 文字列送受信
 */
void esp32_i2c_rw_len(I2C_Handle_t *hi2c, uint8_t *send, uint8_t *recv, uint32_t len)
{
	if (send == NULL && recv == NULL)
	{
		printf(" buffer is null\r\n");
		return;
	}

	//only send
	if (send)
	{
		uint32_t txindex = 0;
		while (txindex < len)
		{
			for (int i = 0; i < 32; i++)
			{
				if (txindex > len)
					break;
				i2c_send(hi2c, ESP32_ADDRESS, &send[txindex], 1);
				txindex++;
			}
			dly_tsk(1);
		}
	}
	else
	{
	//only recv
		for (int i = 0; i < len; i++)
		{
			i2c_recv(hi2c, ESP32_ADDRESS, &recv[i], 1);
		}
	}
	return;
}

/*
 *  SPI/I2C 1 文字送受信
 */
uint8_t esp32_rw(ESP32_Handle_t *hesp, uint8_t data)
{
	if (hesp->hspi == NULL)
	{
		return esp32_i2c_rw(hesp->hi2c, data);
	}
	else
	{
		dly_tsk(1);
		return esp32_spi_rw(hesp->hspi, data);
	}
}

/*
 *  SPI/I2C 文字列送受信
 */
void esp32_rw_len(ESP32_Handle_t *hesp, uint8_t *send, uint8_t *recv, uint32_t len)
{
	if (hesp->hspi == NULL)
	{
		esp32_i2c_rw_len(hesp->hi2c, send, recv, len);
	}
	else
	{
		dly_tsk(1);
		esp32_spi_rw_len(hesp->hspi, send, recv, len);
	}
	return;
}

/*
 *  ESP32 ハード/ソフトリセット
 */
static void esp32_reset(ESP32_Handle_t *hesp)
{
	PRINTF1("Reset ESP32\r\n");

	//here we sleep 1s
	digitalWrite(cs_num, 1);

