fukuen/toppers-maixduino-demo/asp/OBJ/K210_GCC/WIFI/esp32_socket.c
	if ((int8_t)rst_num > 0)
	{
		digitalWrite(rst_num, 0);
		dly_tsk(500);
		digitalWrite(rst_num, 1);
		dly_tsk(1000);
	}
	else
	{
		//soft reset
		esp32_send_command(hesp, SOFT_RESET_CMD, NULL, 0);
		dly_tsk(1500);
	}
}

/*
 *  SPI 接続の場合、レディピンが 0 になるのを待機
 *  0 OK
 *  -1 レスポンスなし
 */
int8_t esp32_wait_for_ready(ESP32_Handle_t *hesp)
{
	if (hesp->hspi == NULL)
		return 0;

	PRINTF3("Wait for ESP32 ready\r\n");

	uint32_t tm = get_millis();
	while ((get_millis() - tm) < 10 * 1000) //10s
	{
		if (digitalRead(rdy_num) == 0)
			return 0;

		PRINTF3(".");
		dly_tsk(1);
	}

	PRINTF3("esp32 not responding\r\n");

	return -1;
}

/*
 *  SPI 接続の場合、レディピンが 1 になるのを待機
 *  0 OK
 *  -1 レスポンスなし
 */
int8_t esp32_wait_for_active(ESP32_Handle_t *hesp)
{
	if (hesp->hspi == NULL)
		return 0;

	PRINTF3("Wait for ESP32 active\r\n");

	uint32_t tm = get_millis();
	while ((get_millis() - tm) < 1000) //1s
	{
		if (digitalRead(rdy_num) == 1)
			return 0;

		PRINTF3(".");
		dly_tsk(1); //FIXME
	}

	PRINTF3("esp32 not responding\r\n");

	return -1;
}

#define lc_buf_len 256
uint8_t lc_send_buf[lc_buf_len];
uint8_t lc_buf_flag = 0;

/*
 *  ESP32 にパラメータを含めてコマンドを送信
 *  0 OK
 *  -1 エラー
 */
static int8_t esp32_send_command(ESP32_Handle_t *hesp, uint8_t cmd, esp32_params_t *params, uint8_t param_len_16)
{
	uint32_t packet_len = 0;

	packet_len = 4; // header + end byte
	if (params != NULL)
	{
		for (uint32_t i = 0; i < params->params_num; i++)
		{
			packet_len += params->params[i]->param_len;
			packet_len += 1; // size byte
			if (param_len_16)
				packet_len += 1;
		}
	}
	while (packet_len % 4 != 0)
		packet_len += 1;

	uint8_t *sendbuf = NULL;

	if (packet_len > lc_buf_len)
	{
		sendbuf = (uint8_t *)malloc(sizeof(uint8_t) * packet_len);
		lc_buf_flag = 0;
		if (!sendbuf)
		{
			PRINTF11("%s: malloc error\r\n", __func__);
			return -1;
		}
	}
	else
	{
		sendbuf = lc_send_buf;
		lc_buf_flag = 1;
	}

	sendbuf[0] = START_CMD;
	sendbuf[1] = cmd & ~REPLY_FLAG;
	if (params != NULL)
		sendbuf[2] = params->params_num;
	else
		sendbuf[2] = 0;

	uint32_t ptr = 3;

	if (params != NULL)
	{
		//handle parameters here
		for (uint32_t i = 0; i < params->params_num; i++)
		{
			PRINTF21("\tSending param #%d is %d bytes long\r\n", i, params->params[i]->param_len);

			if (param_len_16)
			{
				sendbuf[ptr] = (uint8_t)((params->params[i]->param_len >> 8) & 0xFF);
				ptr += 1;
			}
			sendbuf[ptr] = (uint8_t)(params->params[i]->param_len & 0xFF);
			ptr += 1;
			memcpy(sendbuf + ptr, params->params[i]->param, params->params[i]->param_len);
			ptr += params->params[i]->param_len;
		}
	}
	sendbuf[ptr] = END_CMD;

	esp32_wait_for_ready(hesp);
	digitalWrite(cs_num, 0);

	uint32_t tm = get_millis();
	esp32_wait_for_active(hesp);

	if ((get_millis() - tm) > 1000)
	{
		PRINTF1("ESP32 timed out on SPI select\r\n");
		digitalWrite(cs_num, 1);
		if (lc_buf_flag == 0)
		{
			free(sendbuf);
			sendbuf = NULL;
		}
		else
		{
			memset(sendbuf, 0, packet_len);
		}
		return -1;
	}

	esp32_rw_len(hesp, sendbuf, NULL, packet_len);
	digitalWrite(cs_num, 1);

#if (ESP32_DEBUG >= 3)
	if (packet_len < 100)
	{
		printk("Wrote buf packet_len --> %d: ", packet_len);
		for (uint32_t i = 0; i < packet_len; i++)
			printk("%02x ", sendbuf[i]);
		printk("\r\n");
	}
#endif
	if (lc_buf_flag == 0)
	{
		free(sendbuf);
		sendbuf = NULL;
	}
	else
	{
		memset(sendbuf, 0, packet_len);
	}
	return 0;
}

/*
 *  ESP32 から 1 バイト受信
 *  戻り データ
 */
uint8_t esp32_read_byte(ESP32_Handle_t *hesp)
{
	uint8_t read = 0x0;

	read = esp32_rw(hesp, 0xff);

	PRINTF31("\t\tRead:%02x\r\n", read);

	return read;
}

/*
 *  ESP32 から複数バイト受信
 */
void esp32_read_bytes(ESP32_Handle_t *hesp, uint8_t *buffer, uint32_t len)
{
	esp32_rw_len(hesp, NULL, buffer, len);

#if (ESP32_DEBUG >= 3)
	if (len < 100)
	{
		printk("\t\tRead:");
		for (uint32_t i = 0; i < len; i++)
			printk("%02x ", *(buffer + i));
		printk("\r\n");
	}
#endif
}

/*
 *  ESP32 から特定の文字が受信されるまで待機、違う文字はスキップする
 *  0 OK
 *  -1 エラー、タイムアウト
 */
int8_t esp32_wait_spc_char(ESP32_Handle_t *hesp, uint8_t want)
{
	uint8_t read = 0x0;
	uint32_t tm = get_millis();

	while ((get_millis() - tm) < 100)
	{
		read = esp32_read_byte(hesp);

		if (read == ERR_CMD)
		{
			PRINTF1("Error response to command\r\n");
			return -1;
		}
		else if (read == want)
			return 0;
	}

	return -1;
}

/*
 *  ESP32 から特定の 1 文字を受信、一致しなければエラー
 *  0 OK
 *  -1 エラー
 */
uint8_t esp32_check_data(ESP32_Handle_t *hesp, uint8_t want)
{
	uint8_t read = esp32_read_byte(hesp);

	if (read != want)
	{
		PRINTF11("Expected %02X but got %02X\r\n", want, read);
		return -1;
	}
	return 0;
}

/*
 *  ESP32 からのレスポンスを受信してパラメータ解析
 *  NULL エラー
 */
esp32_params_t *esp32_wait_response_cmd(ESP32_Handle_t *hesp, uint8_t cmd, uint32_t *num_responses, uint8_t param_len_16)
{
	uint32_t num_of_resp = 0;

	esp32_wait_for_ready(hesp);

	digitalWrite(cs_num, 0);

	uint32_t tm = get_millis();
	esp32_wait_for_active(hesp);

	if ((get_millis() - tm) > 1000)
	{
		PRINTF1("ESP32 timed out on SPI select\r\n");
		digitalWrite(cs_num, 1);
		return NULL;
	}

	// wait DUMMY_CMD when I2C
	if (hesp->hspi == NULL)
	{
		if (esp32_wait_spc_char(hesp, DUMMY_CMD) != 0)
		{
			PRINTF1("esp32_wait_spc_char DUMMY_CMD error\r\n");
			digitalWrite(cs_num, 1);
			return NULL;
		}
	}

	if (esp32_wait_spc_char(hesp, START_CMD) != 0)
	{
		PRINTF1("esp32_wait_spc_char START_CMD error\r\n");
		digitalWrite(cs_num, 1);
		return NULL;
	}

	if (esp32_check_data(hesp, cmd | REPLY_FLAG) != 0)
	{
		PRINTF1("esp32_check_data cmd | REPLY_FLAG error\r\n");
		digitalWrite(cs_num, 1);
		return NULL;
	}

	if (num_responses)
	{
		if (esp32_check_data(hesp, *num_responses) != 0)
		{
			PRINTF1("esp32_check_data num_responses error\r\n");
			digitalWrite(cs_num, 1);
			return NULL;
		}
		num_of_resp = *num_responses;
	}
	else
	{
		num_of_resp = esp32_read_byte(hesp);
	}

	esp32_params_t *params_ret = (esp32_params_t *)malloc(sizeof(esp32_params_t));

	params_ret->del = delete_esp32_params;
	params_ret->params_num = num_of_resp;
	params_ret->params = (void *)malloc(sizeof(void *) * num_of_resp);

