fukuen/toppers-maixduino-demo/asp/OBJ/K210_GCC/WIFI/esp32_socket.c
	for (uint32_t i = 0; i < num_of_resp; i++)
	{
		params_ret->params[i] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		params_ret->params[i]->param_len = esp32_read_byte(hesp);

		if (param_len_16)
		{
			params_ret->params[i]->param_len <<= 8;
			params_ret->params[i]->param_len |= esp32_read_byte(hesp);
		}

		PRINTF21("\tParameter #%d length is %d\r\n", i, params_ret->params[i]->param_len);

		params_ret->params[i]->param = (uint8_t *)malloc(sizeof(uint8_t) * params_ret->params[i]->param_len);
		esp32_read_bytes(hesp, params_ret->params[i]->param, params_ret->params[i]->param_len);
	}

	if (esp32_check_data(hesp, END_CMD) != 0)
	{
		PRINTF1("esp32_check_data END_CMD error\r\n");
		digitalWrite(cs_num, 1);
		return NULL;
	}

	digitalWrite(cs_num, 1);

	return params_ret;
}

/*
 *  ESP32 にコマンド送信およびレスポンスを受信
 *  NULL エラー
 */
esp32_params_t *esp32_send_command_get_response(ESP32_Handle_t *hesp, uint8_t cmd, esp32_params_t *params, uint32_t *num_resp, uint8_t sent_param_len_16, uint8_t recv_param_len_16)
{
	uint32_t resp_num;

	if (!num_resp)
		resp_num = 1;
	else
		resp_num = *num_resp;

	esp32_send_command(hesp, cmd, params, sent_param_len_16);
	return esp32_wait_response_cmd(hesp, cmd, &resp_num, recv_param_len_16);
}

/*
 *  パラメータメモリ開放
 */
static void delete_esp32_params(void *arg)
{
	esp32_params_t *params = (esp32_params_t *)arg;

	for (uint8_t i = 0; i < params->params_num; i++)
	{
		esp32_param_t *param = params->params[i];
		free(param->param);
		free(param);
	}
	free(params->params);
	free(params);
}

/*
 *  パラメータの構築 1 パラメータ
 */
static esp32_params_t *esp32_params_alloc_1param(uint32_t len, uint8_t *buf)
{
	esp32_params_t *ret = (esp32_params_t *)malloc(sizeof(esp32_params_t));

	ret->del = delete_esp32_params;

	ret->params_num = 1;
	ret->params = (void *)malloc(sizeof(void *) * ret->params_num);
	ret->params[0] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
	ret->params[0]->param_len = len;
	ret->params[0]->param = (uint8_t *)malloc(sizeof(uint8_t) * len);
	memcpy(ret->params[0]->param, buf, len);

	return ret;
}

/*
 *  パラメータの構築 2 パラメータ
 */
static esp32_params_t *esp32_params_alloc_2param(uint32_t len_0, uint8_t *buf_0, uint32_t len_1, uint8_t *buf_1)
{
	esp32_params_t *ret = (esp32_params_t *)malloc(sizeof(esp32_params_t));

	ret->del = delete_esp32_params;

	ret->params_num = 2;
	ret->params = (void *)malloc(sizeof(void *) * ret->params_num);
	//
	ret->params[0] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
	ret->params[0]->param_len = len_0;
	ret->params[0]->param = (uint8_t *)malloc(sizeof(uint8_t) * len_0);
	memcpy(ret->params[0]->param, buf_0, len_0);
	//
	ret->params[1] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
	ret->params[1]->param_len = len_1;
	ret->params[1]->param = (uint8_t *)malloc(sizeof(uint8_t) * len_1);
	memcpy(ret->params[1]->param, buf_1, len_1);

	return ret;
}

/*
 *  ESP32 ファームウェアバージョンの取得
 */
ER esp32_firmware_version(ESP32_Handle_t *hesp, char* fw_version)
{
	PRINTF1("Firmware version\r\n");

	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_FW_VERSION_CMD, NULL, NULL, 0, 0);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return E_SYS;
	}

	uint8_t ret_len = resp->params[0]->param_len;
	memcpy(fw_version, resp->params[0]->param, ret_len);
	fw_version[ret_len] = 0;

	resp->del(resp);
	return E_OK;
}

/*
 *  ESP32 のデバッグを有効にする
 */
void esp32_set_debug(ESP32_Handle_t *hesp, uint8_t debug)
{
	esp32_params_t *send = esp32_params_alloc_1param(1, &debug);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SET_DEBUG_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
	}
	resp->del(resp);
}
/*
 *  時刻取得
 */
uint32_t esp32_get_time(ESP32_Handle_t *hesp)
{
	uint8_t data = 0xff;

	esp32_params_t *send = esp32_params_alloc_1param(1, &data);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_TIME_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return 0;
	}

	uint8_t ret_len = resp->params[0]->param_len;
	memcpy(&time, resp->params[0]->param, ret_len);

	resp->del(resp);
	return time;
}

/*
 *  証明書設定
 */
void esp32_set_certificate(ESP32_Handle_t *hesp, char *client_ca)
{
	esp32_params_t *send = esp32_params_alloc_1param(strlen((const char*)client_ca), (uint8_t *)client_ca);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SET_CLIENT_CERT_CMD, send, NULL, 1, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
	}
	resp->del(resp);
}

/*
 *  プライベートキー設定
 */
void esp32_set_private_key(ESP32_Handle_t *hesp, char *private_key)
{
	esp32_params_t *send = esp32_params_alloc_1param(strlen((const char*)private_key), (uint8_t *)private_key);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SET_CERT_KEY_CMD, send, NULL, 1, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
	}
	resp->del(resp);
}

/*
 *  アクセスポイントの SSID を設定
 *  0 OK
 *  -1 エラー
 */
int8_t esp32_wifi_set_network(ESP32_Handle_t *hesp, uint8_t *ssid)
{
	esp32_params_t *send = esp32_params_alloc_1param(strlen((const char*)ssid), ssid);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SET_NET_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	if (resp->params[0]->param[0] != 1)
	{
		PRINTF1("Failed to set network\r\n");
		resp->del(resp);
		return -1;
	}

	resp->del(resp);

	return 0;
}

/*
 *  アクセスポイントの SSID とパスフレーズを設定
 *  0 OK
 *  -1 エラー
 */
int8_t esp32_wifi_set_passphrase(ESP32_Handle_t *hesp, uint8_t *ssid, uint8_t *passphrase)
{
	esp32_params_t *send = esp32_params_alloc_2param(strlen((const char*)ssid), ssid, strlen((const char*)passphrase), passphrase);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SET_PASSPHRASE_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	if (resp->params[0]->param[0] != 1)
	{
		PRINTF11("%s: Failed to set passphrase\r\n", __func__);
		resp->del(resp);
		return -1;
	}

	resp->del(resp);
	return 0;
}

