fukuen/toppers-maixduino-demo/asp/OBJ/K210_GCC/WIFI/esp32_socket.c
/*
 *  WIFI アクセスポイントへの接続状態
 *  -1 エラー
 *  その他 WL_NO_SHIELD, WL_NO_MODULE (なし)
 *        WL_IDLE_STATUS, WL_NO_SSID_AVAIL, WL_SCAN_COMPLETED,
 *        WL_CONNECTED, WL_CONNECT_FAILED, WL_CONNECTION_LOST, WL_DISCONNECTED,
 *        WL_AP_LISTENING, WL_AP_CONNECTED, WL_AP_FAILED
 */
int8_t esp32_status(ESP32_Handle_t *hesp)
{
	PRINTF2("Connection status\r\n");

	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_CONN_STATUS_CMD, NULL, NULL, 0, 0);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -2;
	}
	int8_t ret = (int8_t)resp->params[0]->param[0];

	PRINTF11("Conn Connection: %s\r\n", wlan_enum_to_str(ret));

	resp->del(resp);
	return ret;
}

/*
 *  アクセスポイントへの接続状況
 *  0 接続なし
 *  1 接続中
 */
uint8_t esp32_is_connected(ESP32_Handle_t *hesp)
{
	int8_t stat = esp32_status(hesp);

	if (stat == -2)
	{
		PRINTF11("%s get status error \r\n", __func__);
		esp32_reset(hesp);
		return 2;
	}
	else if (stat == WL_CONNECTED)
		return 0;

	return 1;
}

/*
 *  アクセスポイントへの接続
 *  0 接続成功
 *  -1 接続失敗
 */
int8_t esp32_connect(ESP32_Handle_t *hesp)
{
	PRINTF11("Connect to AP--> ssid: %s password:%s\r\n", hesp->Init.ssid, hesp->Init.pass);
	if (hesp->Init.pass)
		esp32_wifi_set_passphrase(hesp, (uint8_t *)hesp->Init.ssid, (uint8_t *)hesp->Init.pass);
	else
		esp32_wifi_set_network(hesp, (uint8_t *)hesp->Init.ssid);

	int8_t stat = -1;

	for (uint8_t i = 0; i < hesp->Init.retry_times; i++)
	{
		stat = esp32_status(hesp);

		if (stat == -1)
		{
			PRINTF11("%s get status error \r\n", __func__);
			esp32_reset(hesp);
			return -1;
		}
		else if (stat == WL_CONNECTED)
			return 0;
		else if (stat == WL_CONNECT_FAILED)
			return -2;
		dly_tsk(1000);
	}
	stat = esp32_status(hesp);

	if (stat == WL_CONNECT_FAILED || stat == WL_CONNECTION_LOST || stat == WL_DISCONNECTED)
	{
		PRINTF11("Failed to connect to ssid: %s\r\n", ssid);

		return -3;
	}

	if (stat == WL_NO_SSID_AVAIL)
	{
		PRINTF11("No such ssid: %s\r\n", ssid);

		return -4;
	}

	PRINTF11("Unknown error 0x%02X", stat);

	return -5;
}

/*
 *  アクセスポイントから切断
 */
int8_t esp32_disconnect(ESP32_Handle_t *hesp)
{
	esp32_params_t *resp = esp32_send_command_get_response(hesp, DISCONNECT_CMD, NULL, NULL, 0, 0);
	if (resp == NULL)
	{
		return -1;
	}
	int8_t ret = (int8_t)resp->params[0]->param[0];
	resp->del(resp);
	return ret;
}

/*
 *  ホスト名からIPアドレス取得
 *  0 OK
 *  -1 エラー
 */
int esp32_get_host_by_name(ESP32_Handle_t *hesp, uint8_t *hostname, uint8_t *ip)
{
	PRINTF1("*** Get host by name\r\n");

	esp32_params_t *send = esp32_params_alloc_1param(strlen((const char*)hostname), hostname);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, REQ_HOST_BY_NAME_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
//        return EIO;
		return -2;
	}

	if (resp->params[0]->param[0] != 1)
	{
		PRINTF1("Failed to request hostname\r\n");
		resp->del(resp);
//        return EINVAL;
		return -1;
	}
	resp->del(resp);

	resp = esp32_send_command_get_response(hesp, GET_HOST_BY_NAME_CMD, NULL, NULL, 0, 0);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
//        return EIO;
		return -2;
	}

#if (ESP32_DEBUG >= 2)
	printk("get_host_by_name:%s-->", hostname);
	for (uint8_t i = 0; i < resp->params[0]->param_len; i++)
	{
		printk("%d", resp->params[0]->param[i]);
		if (i < resp->params[0]->param_len - 1)
			printk(".");
	}
	printk("\r\n");
#endif

	memcpy(ip, resp->params[0]->param, resp->params[0]->param_len);
	resp->del(resp);

	return 0;
}

/*
 *  ESP32 から空ソケット番号を取得
 *  0xff エラー
 *  その他 OK
 */
uint8_t esp32_get_socket(ESP32_Handle_t *hesp)
{
	PRINTF1("*** Get socket\r\n");
	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_SOCKET_CMD, NULL, NULL, 0, 0);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return 0xff;
	}

	uint8_t socket = resp->params[0]->param[0];

	if (socket == 255)
	{
		PRINTF1("No sockets available\r\n");
		resp->del(resp);
		return 0xff;
	}

	PRINTF11("Allocated socket #%d\r\n", socket);

	resp->del(resp);
	return (int16_t)socket;
}

/*
 *  宛先の IP アドレスまたはホスト名を指定してソケットをオープン
 *  宛先タイプ 0 IP アドレス
 *           1 ホスト名 (TCP_MODEではホスト名ではエラーになる)
 *  0 OK
 *  -1 エラー
 */
int8_t esp32_socket_open(ESP32_Handle_t *hesp, uint8_t *dest, uint8_t dest_type, uint16_t port, esp32_socket_mode_enum_t conn_mode)
{
	uint8_t port_arr[2];

	port_arr[0] = (uint8_t)(port >> 8);
	port_arr[1] = (uint8_t)(port);

	PRINTF21("port: 0x%02x 0x%02x\r\n", port_arr[0], port_arr[1]);

	esp32_params_t *send = (esp32_params_t *)malloc(sizeof(esp32_params_t));
	send->del = delete_esp32_params;

	uint32_t param_len = 0;

	if (dest_type)
	{
		send->params_num = 5;
		send->params = (void *)malloc(sizeof(void *) * send->params_num);
		//
		param_len = strlen((const char*)dest);
		send->params[0] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[0]->param_len = param_len;
		send->params[0]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		memcpy(send->params[0]->param, dest, param_len);
		//
		param_len = 4;
		send->params[1] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[1]->param_len = param_len;
		send->params[1]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		memset(send->params[1]->param, 0, param_len);
		//
		param_len = 2;
		send->params[2] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[2]->param_len = param_len;
		send->params[2]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		memcpy(send->params[2]->param, port_arr, param_len);
		//
		param_len = 1;
		send->params[3] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[3]->param_len = param_len;
		send->params[3]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		send->params[3]->param[0] = hesp->socket_num;
		//
		param_len = 1;
		send->params[4] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[4]->param_len = param_len;
		send->params[4]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		send->params[4]->param[0] = conn_mode;
	}
	else
	{
		send->params_num = 4;
		send->params = (void *)malloc(sizeof(void *) * send->params_num);
		//
		param_len = 4;
		send->params[0] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[0]->param_len = param_len;
		send->params[0]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		memcpy(send->params[0]->param, dest, param_len);
		//
		param_len = 2;
		send->params[1] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[1]->param_len = param_len;
		send->params[1]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		memcpy(send->params[1]->param, port_arr, param_len);
		//
		param_len = 1;
		send->params[2] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[2]->param_len = param_len;
		send->params[2]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		send->params[2]->param[0] = hesp->socket_num;
		//
		param_len = 1;
		send->params[3] = (esp32_param_t *)malloc(sizeof(esp32_param_t));
		send->params[3]->param_len = param_len;
		send->params[3]->param = (uint8_t *)malloc(sizeof(uint8_t) * param_len);
		send->params[3]->param[0] = conn_mode;
	}

