fukuen/toppers-maixduino-demo/asp/OBJ/K210_GCC/WIFI/esp32_socket.c
	esp32_params_t *resp = esp32_send_command_get_response(hesp, START_CLIENT_TCP_CMD, send, NULL, 0, 0);

	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	if (resp->params[0]->param[0] != 1)
	{
		PRINTF1("Could not connect to remote server\r\n");
		resp->del(resp);

		return -1;
	}
	resp->del(resp);
	return 0;
}

/*
 *  ソケットの接続状態
 *  -1 エラー
 *  その他 SOCKET_CLOSED, SOCKET_LISTEN,
 *        SOCKET_SYN_SENT, SOCKET_SYN_RCVD, SOCKET_ESTABLISHED, SOCKET_FIN_WAIT_1,
 *        SOCKET_FIN_WAIT_2, SOCKET_CLOSE_WAIT, SOCKET_CLOSING, SOCKET_LAST_ACK,
 *        SOCKET_TIME_WAIT
 */
esp32_socket_enum_t esp32_socket_status(ESP32_Handle_t *hesp)
{
	esp32_params_t *send = esp32_params_alloc_1param(1, &(hesp->socket_num));
	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_CLIENT_STATE_TCP_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return 0xff;
	}
	esp32_socket_enum_t ret;

	ret = (esp32_socket_enum_t)resp->params[0]->param[0];

	resp->del(resp);

	PRINTF21("sock stat :%d\r\n", ret);
	return ret;
}

/*
 *  ソケットの接続状態
 *  0 接続なし
 *  1 接続中
 */
uint8_t esp32_socket_connected(ESP32_Handle_t *hesp)
{
	return (esp32_socket_status(hesp) == SOCKET_ESTABLISHED);
}

/*
 *  ソケットに書き込み
 *  0 エラー
 *  送信長 OK
 */
uint32_t esp32_socket_write(ESP32_Handle_t *hesp, uint8_t *buffer, uint16_t len)
{
	esp32_params_t *send = esp32_params_alloc_2param(1, &(hesp->socket_num), len, buffer);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, SEND_DATA_TCP_CMD, send, NULL, 1, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return 0;
	}
	uint16_t sent = ( ((uint16_t)(resp->params[0]->param[1]) << 8) & 0xff00 ) | (uint16_t)(resp->params[0]->param[0]);
	// if (sent != len) //TODO: the firmware is nonblock, so return value maybe < len
	if (sent == 0)
	{
		PRINTF11("Failed to send %d bytes (sent %d)", len, sent);
		resp->del(resp);
		return 0;
	}

	resp->del(resp);
	return sent;
}

/*
 *  ソケットから受信できるデータ長
 */
int esp32_socket_available(ESP32_Handle_t *hesp)
{
	esp32_params_t *send = esp32_params_alloc_1param(1, &(hesp->socket_num));
	esp32_params_t *resp = esp32_send_command_get_response(hesp, AVAIL_DATA_TCP_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	int reply = 0;

	reply = (int)((uint16_t)(resp->params[0]->param[1] << 8) | (uint16_t)(resp->params[0]->param[0]));

	if(reply > 0)
	{
		PRINTF11("ESPSocket: %d bytes available\r\n", reply);
	}

	resp->del(resp);
	return reply;
}

/*
 *  ソケットから読み取り
 */
int esp32_socket_read(ESP32_Handle_t *hesp, uint8_t *buff, uint16_t size)
{
	PRINTF11("Reading %d bytes from ESP socket with status %s\r\n", size, socket_enum_to_str(esp32_socket_status(hesp)));

	uint8_t len[2];

	len[0] = (uint8_t)(size & 0xff);
	len[1] = (uint8_t)((size >> 8) & 0xff);

	PRINTF31("len_0:%02x\tlen_1:%02x\r\n", len[0], len[1]);

	esp32_params_t *send = esp32_params_alloc_2param(1, &(hesp->socket_num), 2, len);
	esp32_params_t *resp = esp32_send_command_get_response(hesp, GET_DATABUF_TCP_CMD, send, NULL, 1, 1);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	uint16_t real_read_size = resp->params[0]->param_len;

	if (real_read_size != 0)
		memcpy(buff, resp->params[0]->param, real_read_size);
	resp->del(resp);

	return real_read_size;
}

/*
 *  宛先の IP アドレスまたはホスト名を指定してソケットをオープン
 *  宛先タイプ 0 IP アドレス
 *           1 ホスト名 (TCP_MODEではホスト名ではエラーになる)
 *  0 OK
 *  -1 エラー
 */
int8_t esp32_socket_connect(ESP32_Handle_t *hesp, uint8_t *dest, uint8_t dest_type, uint16_t port, esp32_socket_mode_enum_t conn_mod)
{
	PRINTF11("*** Socket connect mode:%d\r\n", conn_mod);
	int8_t ret = esp32_socket_open(hesp, dest, dest_type, port, conn_mod);
	if ( ret == -2 )
	{
		return -2;
	}
	if(ret == -1)
	{
		return -1;
	}
	if(conn_mod == UDP_MODE)
		return 0;
	uint32_t tm = get_millis();

	while ((get_millis() - tm) < 3 * 1000) //3s
	{
		uint8_t ret = esp32_socket_status(hesp);
		if (ret == SOCKET_ESTABLISHED)
			return 0;
		else if(ret == 0xff) // EIO
		{
			return -2;
		}
		dly_tsk(100);
	}
	return -3;
}

/*
 *  ソケットのクローズ
 *  0 OK
 *  -1 エラー
 */
int8_t esp32_socket_close(ESP32_Handle_t *hesp)
{
	esp32_params_t *send = esp32_params_alloc_1param(1, &(hesp->socket_num));
	esp32_params_t *resp = esp32_send_command_get_response(hesp, STOP_CLIENT_TCP_CMD, send, NULL, 0, 0);
	send->del(send);

	if (resp == NULL)
	{
		PRINTF11("%s: get resp error!\r\n", __func__);
		return -1;
	}

	if (resp->params[0]->param[0] != 1)
	{

		PRINTF1("Failed to close socket\r\n");
		resp->del(resp);
		return -1;
	}
	resp->del(resp);
	return 0;
}

#define ENUM_TO_STR(x) \
	case (x):          \
		return (#x)

char *socket_enum_to_str(esp32_socket_enum_t x)
{
	switch (x)
	{
		ENUM_TO_STR(SOCKET_CLOSED);
		ENUM_TO_STR(SOCKET_LISTEN);
		ENUM_TO_STR(SOCKET_SYN_SENT);
		ENUM_TO_STR(SOCKET_SYN_RCVD);
		ENUM_TO_STR(SOCKET_ESTABLISHED);
		ENUM_TO_STR(SOCKET_FIN_WAIT_1);
		ENUM_TO_STR(SOCKET_FIN_WAIT_2);
		ENUM_TO_STR(SOCKET_CLOSE_WAIT);
		ENUM_TO_STR(SOCKET_CLOSING);
		ENUM_TO_STR(SOCKET_LAST_ACK);
		ENUM_TO_STR(SOCKET_TIME_WAIT);
	}
	return "unknown";
}

char *wlan_enum_to_str(esp32_wlan_enum_t x)
{
	switch (x)
	{
		ENUM_TO_STR(WL_IDLE_STATUS);
		ENUM_TO_STR(WL_NO_SSID_AVAIL);
		ENUM_TO_STR(WL_SCAN_COMPLETED);
		ENUM_TO_STR(WL_CONNECTED);
		ENUM_TO_STR(WL_CONNECT_FAILED);
		ENUM_TO_STR(WL_CONNECTION_LOST);
		ENUM_TO_STR(WL_DISCONNECTED);
		ENUM_TO_STR(WL_AP_LISTENING);
		ENUM_TO_STR(WL_AP_CONNECTED);
		ENUM_TO_STR(WL_AP_FAILED);
		ENUM_TO_STR(WL_NO_SHIELD);
		ENUM_TO_STR(WL_NO_MODULE);
	}
	return "unknown";
}

/*
 *  ESP32 初期設定
 *  parameter1  init: ESP32 初期設定構造体へのポインタ
 *  return ESP32 ハンドラへのポインタ、NULL でエラー
 */
ESP32_Handle_t * esp32_init(ESP32_Init_t *init)
{
	ESP32_Handle_t *hesp;

	if(init == NULL)
		return NULL;

	hesp = &esp32Handle;
	memcpy(&hesp->Init, init, sizeof(ESP32_Init_t));

	hesp->hspi = init->hspi;
	hesp->hi2c = init->hi2c;
	hesp->connection = WL_IDLE_STATUS;
	hesp->status = SOCKET_CLOSED;
	hesp->socket_num = 0xff;
 
	cs_num = 0;
	rst_num = 0;
	rdy_num = 0;

	if (init->hspi == NULL)
	{
		if (init->hi2c == NULL)
			return NULL;
		PRINTF1("ESP32 USE I2C INTERFACE\r\n");
	}
	else
	{
		PRINTF1("ESP32 USE SPI INTERFACE\r\n");

		cs_num = init->cs_num;
		rst_num = init->rst_num;
		rdy_num = init->rdy_num;

		//cs
		pinMode(cs_num, OUTPUT);
		digitalWrite(cs_num, HIGH);

		//ready
		pinMode(rdy_num, INPUT);

		if ((int8_t)rst_num > 0)
		{
			pinMode(rst_num, OUTPUT);
		}
	}
	
	esp32_reset(hesp);

	return hesp;
}

/*
 *  ESP32 終了設定
 *  parameter1  hesp: ESP32 ハンドラへのポインタ
 *  return ERコード
 */
ER esp32_deinit(ESP32_Handle_t *hesp)
{
	if(hesp == NULL)
		return E_PAR;

	hesp->connection = WL_IDLE_STATUS;
	hesp->status = SOCKET_CLOSED;
	hesp->socket_num = 0xff;
	return E_OK;
}
